{
  "title" : "Æbleskiver – Danish Pancake Balls",
  "ingredients" : [
    {
      "amount" : "1 1⁄4",
      "unit" : "cups",
      "name" : "all-purpose flour"
    },
    {
      "amount" : "1⁄2",
      "unit" : "tsp",
      "name" : "salt"
    },
    {
      "amount" : "2 1⁄4",
      "unit" : "tsp",
      "name" : "baking powder"
    },
    {
      "amount" : "2",
      "unit" : "tbsp",
      "name" : "sugar"
    },
    {
      "amount" : "1⁄2",
      "unit" : "tsp",
      "name" : "ground cardamon or cinnamon"
    },
    {
      "amount" : "1",
      "unit" : "pcs",
      "name" : "egg, beaten"
    },
    {
      "amount" : "1",
      "unit" : "cup",
      "name" : "milk"
    },
    {
      "amount" : "3",
      "unit" : "tbsp",
      "name" : "butter or margarine, divided, melted and cooled"
    },
    {
      "amount" : "",
      "unit" : "",
      "name" : "powdered sugar"
    },
    {
      "amount" : "",
      "unit" : "",
      "name" : "fruit jam or preserves"
    }
  ],
  "directions" : "Sift flour with salt, baking powder, granulated sugar, and cardamom in medium-size bowl. Combine egg, milk, and 2 tablespoons of butter in small bowl. Add wet mixture to dry combination and stir until blended and smooth.\n\nPlace a seasoned aebleskiver pan over medium heat until water sprinkled in pan sizzles. Brush each cup lightly with some of the remaining butter. Fill each cup approximately 2/3 full with batter. About 30 seconds later, a thin shell forms on the bottom of each pancake ball. Coerce unbaked batter to flow out by sticking a slender wooden or metal skewer into baked portion and gently pulling shell almost halfway up.\n\nContinue to rotate each pancake ball about every 30 seconds as the shell begins to set, pulling up the baked shell to let remaining batter flow out into cup. After about four turns, the ball should be almost formed and you can turn it upside down to seal.\n\nContinue baking, rotating the balls frequently until they are an even golden brown and a skewer inserted in center comes out clean. Using skewer, lift balls from pan when baked. Repeat with remaining batter.\n\nServe immediately, or keep warm for as long as 30 minutes in a bun warmer or cloth-lined basket on an electric warming tray. Dust with powdered sugar. Break each ball in half, fill with jam, and eat out-of-hand.\n",
  "notes" : "If your ebelskiver pan is new and isn’t Teflon coated, season it by preheating it to medium-hot – until water dripped onto the surface sizzles. Brush entire cooking surface generously with salad oil. Continue to heat just until oil smokes, then remove from heat and let cool completely. Wipe clean and your ebelskiver is ready for use. If your old ebelskiver seems to stick, wash its cooking surface in soapy water. Then season as directed above.",
  "course" : "Dessert",
  "meal" : "Dinner",
  "locale" : "en-US"
}